Revit 2024 API
InternalDefinition.Name Property
The user-visible name for the parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override string Name { get; }
Visual Basic
Public Overrides ReadOnly Property Name As String
	Get
Visual C++
public:
virtual property String^ Name {
	String^ get () override;
}
See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace